backend/response.xml

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions name="FreeWebService" targetNamespace="http://tempuri.org/"
                  xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
                  xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
                  xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
                  xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:tns="http://tempuri.org/"
                  xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
                  xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex"
                  xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy"
                  xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl"
                  xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract"
                  xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy"
                  xmlns:wsa10="http://www.w3.org/2005/08/addressing"
                  xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata">
    <wsdl:types>
        <xsd:schema targetNamespace="http://tempuri.org/Imports">
            <xsd:import schemaLocation="http://legislatie.just.ro/apiws/FreeWebService.svc?xsd=xsd0"
                        namespace="http://tempuri.org/"/>
            <xsd:import schemaLocation="http://legislatie.just.ro/apiws/FreeWebService.svc?xsd=xsd1"
                        namespace="http://schemas.microsoft.com/2003/10/Serialization/"/>
            <xsd:import schemaLocation="http://legislatie.just.ro/apiws/FreeWebService.svc?xsd=xsd2"
                        namespace="http://schemas.datacontract.org/2004/07/FreeWebService"/>
        </xsd:schema>
    </wsdl:types>
    <wsdl:message name="IFreeWebService_GetToken_InputMessage">
        <wsdl:part name="parameters" element="tns:GetToken"/>
    </wsdl:message>
    <wsdl:message name="IFreeWebService_GetToken_OutputMessage">
        <wsdl:part name="parameters" element="tns:GetTokenResponse"/>
    </wsdl:message>
    <wsdl:message name="IFreeWebService_Search_InputMessage">
        <wsdl:part name="parameters" element="tns:Search"/>
    </wsdl:message>
    <wsdl:message name="IFreeWebService_Search_OutputMessage">
        <wsdl:part name="parameters" element="tns:SearchResponse"/>
    </wsdl:message>
    <wsdl:portType name="IFreeWebService">
        <wsdl:operation name="GetToken">
            <wsdl:input wsaw:Action="http://tempuri.org/IFreeWebService/GetToken"
                        message="tns:IFreeWebService_GetToken_InputMessage"/>
            <wsdl:output wsaw:Action="http://tempuri.org/IFreeWebService/GetTokenResponse"
                         message="tns:IFreeWebService_GetToken_OutputMessage"/>
        </wsdl:operation>
        <wsdl:operation name="Search">
            <wsdl:input wsaw:Action="http://tempuri.org/IFreeWebService/Search"
                        message="tns:IFreeWebService_Search_InputMessage"/>
            <wsdl:output wsaw:Action="http://tempuri.org/IFreeWebService/SearchResponse"
                         message="tns:IFreeWebService_Search_OutputMessage"/>
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding name="SoapEndPoint" type="tns:IFreeWebService">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="GetToken">
            <soap:operation soapAction="http://tempuri.org/IFreeWebService/GetToken" style="document"/>
            <wsdl:input>
                <soap:body use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal"/>
            </wsdl:output>
        </wsdl:operation>
        <wsdl:operation name="Search">
            <soap:operation soapAction="http://tempuri.org/IFreeWebService/Search" style="document"/>
            <wsdl:input>
                <soap:body use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service name="FreeWebService">
        <wsdl:port name="SoapEndPoint" binding="tns:SoapEndPoint">
            <soap:address location="http://legislatie.just.ro/apiws/FreeWebService.svc/SOAP"/>
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>